tf plan
```
------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.catalog.module.web.aws_lb_target_group_attachment.lb[0] must be replaced
-/+ resource "aws_lb_target_group_attachment" "lb" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:587807691409:targetgroup/catalog-web-sandbox/b6776b3c311b34c3-20201208225251480900000001" -> (known after apply)
      ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:587807691409:targetgroup/catalog-web-sandbox/b6776b3c311b34c3" -> (known after apply) # forces replacement
        target_id        = "i-04ae9330f89857726"
    }

  # module.catalog_next.module.web.aws_lb_target_group_attachment.lb[0] must be replaced
-/+ resource "aws_lb_target_group_attachment" "lb" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:587807691409:targetgroup/catalog-next-web-sandbox/1ba16cdd4ffec686-20201208225252855600000001" -> (known after apply)
      ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:587807691409:targetgroup/catalog-next-web-sandbox/1ba16cdd4ffec686" -> (known after apply) # forces replacement
        target_id        = "i-0d2edd60e176633a5"
    }

  # module.inventory.module.web.aws_lb_target_group_attachment.lb[0] must be replaced
-/+ resource "aws_lb_target_group_attachment" "lb" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:587807691409:targetgroup/inventory-sandbox/f299344ef8db4781-20201208225251502400000003" -> (known after apply)
      ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:587807691409:targetgroup/inventory-sandbox/f299344ef8db4781" -> (known after apply) # forces replacement
        target_id        = "i-01f4189152f11f533"
    }

  # module.inventory_next.module.web.aws_lb_target_group_attachment.lb[0] must be replaced
-/+ resource "aws_lb_target_group_attachment" "lb" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:587807691409:targetgroup/inventory-next-sandbox/8095d78e7dea91d2-20201208225251495600000002" -> (known after apply)
      ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:587807691409:targetgroup/inventory-next-sandbox/8095d78e7dea91d2" -> (known after apply) # forces replacement
        target_id        = "i-0300ea1f7a8f3e8f7"
    }

  # module.catalog.module.web.module.lb.aws_lb_listener.frontend_https[0] will be updated in-place
  ~ resource "aws_lb_listener" "frontend_https" {
        arn               = "arn:aws:elasticloadbalancing:us-east-1:587807691409:listener/app/catalog-sandbox-tf/d84cf4df3558393a/58cefe57be8a46fa"
        certificate_arn   = "arn:aws:acm:us-east-1:587807691409:certificate/38e410bf-d0fc-4e03-8668-cd0c22a4b941"
        id                = "arn:aws:elasticloadbalancing:us-east-1:587807691409:listener/app/catalog-sandbox-tf/d84cf4df3558393a/58cefe57be8a46fa"
        load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:587807691409:loadbalancer/app/catalog-sandbox-tf/d84cf4df3558393a"
        port              = 443
        protocol          = "HTTPS"
        ssl_policy        = "ELBSecurityPolicy-2016-08"

      ~ default_action {
            order            = 1
          ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:587807691409:targetgroup/catalog-web-sandbox/b6776b3c311b34c3" -> (known after apply)
            type             = "forward"
        }
    }

  # module.catalog.module.web.module.lb.aws_lb_target_group.main[0] must be replaced
+/- resource "aws_lb_target_group" "main" {
      ~ arn                                = "arn:aws:elasticloadbalancing:us-east-1:587807691409:targetgroup/catalog-web-sandbox/b6776b3c311b34c3" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/catalog-web-sandbox/b6776b3c311b34c3" -> (known after apply)
        deregistration_delay               = 300
      ~ id                                 = "arn:aws:elasticloadbalancing:us-east-1:587807691409:targetgroup/catalog-web-sandbox/b6776b3c311b34c3" -> (known after apply)
        lambda_multi_value_headers_enabled = false
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
        name                               = "catalog-web-sandbox"
      ~ port                               = 80 -> 443 # forces replacement
      ~ protocol                           = "HTTP" -> "HTTPS" # forces replacement
        proxy_protocol_v2                  = false
        slow_start                         = 0
        tags                               = {
            "Environment" = "sandbox"
            "Name"        = "catalog-web-sandbox"
            "Terraform"   = "true"
        }
        target_type                        = "instance"
        vpc_id                             = "vpc-0e4d22d8b2666bf6f"

      ~ health_check {
            enabled             = true
            healthy_threshold   = 3
            interval            = 30
          ~ matcher             = "200" -> (known after apply)
            path                = "/api/action/status_show"
            port                = "traffic-port"
            protocol            = "HTTP"
          ~ timeout             = 5 -> (known after apply)
            unhealthy_threshold = 3
        }

      ~ stickiness {
          ~ cookie_duration = 86400 -> (known after apply)
          ~ enabled         = false -> (known after apply)
          ~ type            = "lb_cookie" -> (known after apply)
        }
    }

  # module.catalog_next.module.web.module.lb.aws_lb_listener.frontend_https[0] will be updated in-place
  ~ resource "aws_lb_listener" "frontend_https" {
        arn               = "arn:aws:elasticloadbalancing:us-east-1:587807691409:listener/app/catalog-next-sandbox-tf/78165876b4c5d188/cebbffacd107a85b"
        certificate_arn   = "arn:aws:acm:us-east-1:587807691409:certificate/cfc8d1fd-9706-4543-bd34-160d6b4299a0"
        id                = "arn:aws:elasticloadbalancing:us-east-1:587807691409:listener/app/catalog-next-sandbox-tf/78165876b4c5d188/cebbffacd107a85b"
        load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:587807691409:loadbalancer/app/catalog-next-sandbox-tf/78165876b4c5d188"
        port              = 443
        protocol          = "HTTPS"
        ssl_policy        = "ELBSecurityPolicy-2016-08"

      ~ default_action {
            order            = 1
          ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:587807691409:targetgroup/catalog-next-web-sandbox/1ba16cdd4ffec686" -> (known after apply)
            type             = "forward"
        }
    }

  # module.catalog_next.module.web.module.lb.aws_lb_target_group.main[0] must be replaced
+/- resource "aws_lb_target_group" "main" {
      ~ arn                                = "arn:aws:elasticloadbalancing:us-east-1:587807691409:targetgroup/catalog-next-web-sandbox/1ba16cdd4ffec686" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/catalog-next-web-sandbox/1ba16cdd4ffec686" -> (known after apply)
        deregistration_delay               = 300
      ~ id                                 = "arn:aws:elasticloadbalancing:us-east-1:587807691409:targetgroup/catalog-next-web-sandbox/1ba16cdd4ffec686" -> (known after apply)
        lambda_multi_value_headers_enabled = false
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
        name                               = "catalog-next-web-sandbox"
      ~ port                               = 80 -> 443 # forces replacement
      ~ protocol                           = "HTTP" -> "HTTPS" # forces replacement
        proxy_protocol_v2                  = false
        slow_start                         = 0
        tags                               = {
            "Environment" = "sandbox"
            "Name"        = "catalog-next-web-sandbox"
            "Terraform"   = "true"
        }
        target_type                        = "instance"
        vpc_id                             = "vpc-0e4d22d8b2666bf6f"

      ~ health_check {
            enabled             = true
            healthy_threshold   = 3
            interval            = 30
          ~ matcher             = "200" -> (known after apply)
            path                = "/api/action/status_show"
            port                = "traffic-port"
            protocol            = "HTTP"
          ~ timeout             = 5 -> (known after apply)
            unhealthy_threshold = 3
        }

      ~ stickiness {
          ~ cookie_duration = 86400 -> (known after apply)
          ~ enabled         = false -> (known after apply)
          ~ type            = "lb_cookie" -> (known after apply)
        }
    }

  # module.inventory.module.web.module.lb.aws_lb_listener.frontend_https[0] will be updated in-place
  ~ resource "aws_lb_listener" "frontend_https" {
        arn               = "arn:aws:elasticloadbalancing:us-east-1:587807691409:listener/app/inventory-sandbox-tf/9aa5129973901c9f/9756d07a5eb5e18b"
        certificate_arn   = "arn:aws:acm:us-east-1:587807691409:certificate/7d2e9743-c4d2-4486-90fd-94eae7e237da"
        id                = "arn:aws:elasticloadbalancing:us-east-1:587807691409:listener/app/inventory-sandbox-tf/9aa5129973901c9f/9756d07a5eb5e18b"
        load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:587807691409:loadbalancer/app/inventory-sandbox-tf/9aa5129973901c9f"
        port              = 443
        protocol          = "HTTPS"
        ssl_policy        = "ELBSecurityPolicy-2016-08"

      ~ default_action {
            order            = 1
          ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:587807691409:targetgroup/inventory-sandbox/f299344ef8db4781" -> (known after apply)
            type             = "forward"
        }
    }

  # module.inventory.module.web.module.lb.aws_lb_target_group.main[0] must be replaced
+/- resource "aws_lb_target_group" "main" {
      ~ arn                                = "arn:aws:elasticloadbalancing:us-east-1:587807691409:targetgroup/inventory-sandbox/f299344ef8db4781" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/inventory-sandbox/f299344ef8db4781" -> (known after apply)
        deregistration_delay               = 300
      ~ id                                 = "arn:aws:elasticloadbalancing:us-east-1:587807691409:targetgroup/inventory-sandbox/f299344ef8db4781" -> (known after apply)
        lambda_multi_value_headers_enabled = false
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
        name                               = "inventory-sandbox"
      ~ port                               = 80 -> 443 # forces replacement
      ~ protocol                           = "HTTP" -> "HTTPS" # forces replacement
        proxy_protocol_v2                  = false
        slow_start                         = 0
        tags                               = {
            "Environment" = "sandbox"
            "Name"        = "inventory-sandbox"
            "Terraform"   = "true"
        }
        target_type                        = "instance"
        vpc_id                             = "vpc-0e4d22d8b2666bf6f"

      ~ health_check {
          ~ enabled             = true -> (known after apply)
          ~ healthy_threshold   = 5 -> (known after apply)
          ~ interval            = 30 -> (known after apply)
          ~ matcher             = "200" -> (known after apply)
          ~ path                = "/" -> (known after apply)
          ~ port                = "traffic-port" -> (known after apply)
          ~ protocol            = "HTTP" -> (known after apply)
          ~ timeout             = 5 -> (known after apply)
          ~ unhealthy_threshold = 2 -> (known after apply)
        }

      ~ stickiness {
          ~ cookie_duration = 86400 -> (known after apply)
          ~ enabled         = false -> (known after apply)
          ~ type            = "lb_cookie" -> (known after apply)
        }
    }

  # module.inventory_next.module.web.module.lb.aws_lb_listener.frontend_https[0] will be updated in-place
  ~ resource "aws_lb_listener" "frontend_https" {
        arn               = "arn:aws:elasticloadbalancing:us-east-1:587807691409:listener/app/inventory-next-sandbox-tf/cb6f9d80931f7482/6d354f4fe7b8e2f7"
        certificate_arn   = "arn:aws:acm:us-east-1:587807691409:certificate/d5084925-96ee-42ba-ad98-661d78b77d4e"
        id                = "arn:aws:elasticloadbalancing:us-east-1:587807691409:listener/app/inventory-next-sandbox-tf/cb6f9d80931f7482/6d354f4fe7b8e2f7"
        load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:587807691409:loadbalancer/app/inventory-next-sandbox-tf/cb6f9d80931f7482"
        port              = 443
        protocol          = "HTTPS"
        ssl_policy        = "ELBSecurityPolicy-2016-08"

      ~ default_action {
            order            = 1
          ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:587807691409:targetgroup/inventory-next-sandbox/8095d78e7dea91d2" -> (known after apply)
            type             = "forward"
        }
    }

  # module.inventory_next.module.web.module.lb.aws_lb_target_group.main[0] must be replaced
+/- resource "aws_lb_target_group" "main" {
      ~ arn                                = "arn:aws:elasticloadbalancing:us-east-1:587807691409:targetgroup/inventory-next-sandbox/8095d78e7dea91d2" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/inventory-next-sandbox/8095d78e7dea91d2" -> (known after apply)
        deregistration_delay               = 300
      ~ id                                 = "arn:aws:elasticloadbalancing:us-east-1:587807691409:targetgroup/inventory-next-sandbox/8095d78e7dea91d2" -> (known after apply)
        lambda_multi_value_headers_enabled = false
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
        name                               = "inventory-next-sandbox"
      ~ port                               = 80 -> 443 # forces replacement
      ~ protocol                           = "HTTP" -> "HTTPS" # forces replacement
        proxy_protocol_v2                  = false
        slow_start                         = 0
        tags                               = {
            "Environment" = "sandbox"
            "Name"        = "inventory-next-sandbox"
            "Terraform"   = "true"
        }
        target_type                        = "instance"
        vpc_id                             = "vpc-0e4d22d8b2666bf6f"

      ~ health_check {
          ~ enabled             = true -> (known after apply)
          ~ healthy_threshold   = 5 -> (known after apply)
          ~ interval            = 30 -> (known after apply)
          ~ matcher             = "200" -> (known after apply)
          ~ path                = "/" -> (known after apply)
          ~ port                = "traffic-port" -> (known after apply)
          ~ protocol            = "HTTP" -> (known after apply)
          ~ timeout             = 5 -> (known after apply)
          ~ unhealthy_threshold = 2 -> (known after apply)
        }

      ~ stickiness {
          ~ cookie_duration = 86400 -> (known after apply)
          ~ enabled         = false -> (known after apply)
          ~ type            = "lb_cookie" -> (known after apply)
        }
    }

Plan: 8 to add, 4 to change, 8 to destroy.

------------------------------------------------------------------------
```